Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ХранилищеИзображений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ХранилищеИзображений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЗаписиКОповещению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЗаписиКОповещению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/омг_НастройкиИнтеграцииСЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>омг_НастройкиИнтеграцииСЛИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПозицииИсключенияИзОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПозицииИсключенияИзОповещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_РаботыСФиксированнымВременемЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_РаботыСФиксированнымВременемЗаписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СтатусыПодтвержденияСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СтатусыПодтвержденияСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыПодтвержденияЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПеренос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просрочено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенесено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтвечает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененоАвтоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Заявка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>омг_БезЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НесколькоСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_БезЗаписиНесколькоВрачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_Алгоритмы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_Алгоритмы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяАлгоритма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/HTTPServices/омг_ИнтеграцияССервисами/Ext/Module.bsl
Функция ПолучитьИзображениеДляОтправки(Запрос)
    
    // 1. По умолчанию готовим ответ 404 (Не найдено)
    Ответ = Новый HTTPСервисОтвет(404);
    
    // 2. Получаем параметр "id" из строки запроса (?id=...)
    СтрокаИД = Запрос.ПараметрыЗапроса.Получить("id");
    
    Если ПустаяСтрока(СтрокаИД) Тогда
        // Если параметр не передан, возвращаем 400 Bad Request
        Возврат Новый HTTPСервисОтвет(400);
    КонецЕсли;
    
    // 3. Преобразуем строку в УникальныйИдентификатор (оборачиваем в Попытку на случай кривого id)
    Попытка
        ИдентификаторЗаписи = Строка(Новый УникальныйИдентификатор(СтрокаИД));
    Исключение
        Возврат Новый HTTPСервисОтвет(400); 
    КонецПопытки;
    
    // 4. Ищем картинку в базе с помощью запроса
    ЗапросБД = Новый Запрос;
    ЗапросБД.Текст = 
        "ВЫБРАТЬ
        |	iga_ХранилищеИзображений.Данные КАК Данные
        |ИЗ
        |	РегистрСведений.iga_ХранилищеИзображений КАК iga_ХранилищеИзображений
        |ГДЕ
        |	iga_ХранилищеИзображений.Идентификатор = &Идентификатор";
        
    ЗапросБД.УстановитьПараметр("Идентификатор", ИдентификаторЗаписи);
    Результат = ЗапросБД.Выполнить();
    
    // 5. Если запись найдена, формируем успешный ответ
    Если Не Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        
        Если Выборка.Данные <> Неопределено Тогда
            // Достаем двоичные данные из хранилища
            ДвоичныеДанныеКартинки = Выборка.Данные.Получить();
            
            Если ТипЗнч(ДвоичныеДанныеКартинки) = Тип("ДвоичныеДанные") Тогда
                // Меняем статус на 200 ОК
                Ответ = Новый HTTPСервисОтвет(200);
                
                // Устанавливаем заголовок Content-Type, чтобы браузер понял, что это картинка.
                // В идеале тип нужно определять динамически, но для старта можно указать универсальный или jpeg
                Ответ.Заголовки.Вставить("Content-Type", "image/jpeg"); 
                
                // Помещаем двоичные данные картинки прямо в тело ответа
                Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеКартинки);
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    
    Возврат Ответ;
    
КонецФункции

Функция СтраницаОповещенияОЗаписиПолучить(Запрос)
    
    // Получаем ID записи из URL
    IDЗаписи = Запрос.ПараметрыЗапроса.Получить("id");
	
	Попытка
		СсылкаЗаявки = Документы.Заявка.ПолучитьСсылку(Новый УникальныйИдентификатор(IDЗаписи));
		
	Исключение
		Возврат Новый HTTPСервисОтвет(404);
	КонецПопытки;
	
	Запись = РегистрыСведений.iga_ЗаписиКОповещению.СоздатьМенеджерЗаписи();
	Запись.Заявка = СсылкаЗаявки;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		
		
		// --- ОТДАЕМ СТРАНИЦУ ОШИБКИ ---
		МакетОшибка = ПолучитьОбщийМакет("iga_ШаблонЗаписьНеНайдена");
		ТекстHTML_Ошибка = МакетОшибка.ПолучитьТекст();
		
		СсылкаWhatsApp = "https://wa.me/77710882357"; // Ссылка на WhatsApp клиники
		
		ТекстHTML_Ошибка = СтрЗаменить(ТекстHTML_Ошибка, "%СсылкаWhatsApp%", СсылкаWhatsApp);
		
		// Возвращаем статус 404 (Not Found) - это хорошая практика для веб-сервисов,
		// хотя визуально пациент увидит красивую страницу
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстHTML_Ошибка, КодировкаТекста.UTF8);
		Возврат Ответ;
		
	КонецЕсли;
		

	
	ОбработчикЭтапов = Обработки.iga_ОбработчикЭтапов.Создать();
	ОбработчикЭтапов.ВходящиеПараметры = Новый Структура;
	ОбработчикЭтапов.ВходящиеПараметры.Вставить("Заявка", СсылкаЗаявки);
	
    // Подготовка общих данных
    ИмяКлиники = "Divera";
    АдресКлиникиRU = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.АдресФилиалаНаРусском);
    АдресКлиникиKK = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.АдресФилиалаНаКазахском);
    
    // Новые ссылки для кнопок
    СсылкаИнстаграм = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.СсылкаИнстаграм);
    Ссылка2GIS = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.Ссылка2гис);
    
    СписокУслугHTML_RU = "";
    СписокУслугHTML_KK = "";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ГруппаЛИС
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПозицииИсключенияИзОповещений.Номенклатура
	               |ИЗ
	               |	РегистрСведений.iga_ПозицииИсключенияИзОповещений КАК iga_ПозицииИсключенияИзОповещений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	               |	ЗаявкаРаботы.ДатаНачала КАК ДатаНачала,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Сотрудник.Ссылка, ЗаявкаРаботы.Ссылка.Сотрудник) КАК Сотрудник,
	               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаРаботы.Продолжительность КАК Продолжительность,
	               |	ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей КАК омг_БезЗаписиНесколькоВрачей,
	               |	ЗаявкаРаботы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ВсеРаботы
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И НЕ ЗаявкаРаботы.Номенклатура В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ГруппаЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ГруппаЛИС КАК ВТ_ГруппаЛИС)
	               |	И ЗаявкаРаботы.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Заявка.Сотрудник КАК Сотрудник,
	               |	Заявка.Сотрудник.Наименование КАК СотрудникНаименование,
	               |	Заявка.ДатаНачала КАК ДатаНачала,
	               |	Заявка.ВремяНачала КАК ВремяНачала,
	               |	Заявка.НесколькоСотрудников КАК НесколькоСотрудников
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	               |	"""" КАК НаименованиеПроцедуры,
	               |	ЗаявкаРаботы.Сотрудник КАК Врач,
	               |	ЗаявкаРаботы.ДатаНачала КАК ДатаНачала,
	               |	ЗаявкаРаботы.Продолжительность КАК Продолжительность,
	               |	ЕстьNull(iga_РаботыСФиксированнымВременемЗаписи.Время, ЗаявкаРаботы.Ссылка.ВремяНачала) КАК ВремяНачала
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсеРаботы.Ссылка КАК Ссылка,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеРаботы.НомерСтроки) КАК ВсегоСтрок
	               |	ИЗ
	               |		ВТ_ВсеРаботы КАК ВТ_ВсеРаботы
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсеРаботы.Ссылка) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеРаботы КАК ЗаявкаРаботы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |			ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |						И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |					ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗаявкаРаботы.Сотрудник)
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |	И ВложенныйЗапрос.ВсегоСтрок = 1
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Номенклатура.НаименованиеПолное, """"),
	               |	ЗаявкаРаботы.Сотрудник,
	               |	ЗаявкаРаботы.ДатаНачала,
	               |	ЗаявкаРаботы.Продолжительность,
	               |	ЕстьNull(iga_РаботыСФиксированнымВременемЗаписи.Время, ЗаявкаРаботы.Ссылка.ВремяНачала)
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсеРаботы.Ссылка КАК Ссылка,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеРаботы.НомерСтроки) КАК ВсегоСтрок
	               |	ИЗ
	               |		ВТ_ВсеРаботы КАК ВТ_ВсеРаботы
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсеРаботы.Ссылка) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеРаботы КАК ЗаявкаРаботы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |			ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |						И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |					ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗаявкаРаботы.Сотрудник)
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |	И НЕ ЗаявкаРаботы.Номенклатура = &ПустаяНоменклатура
	               |	И ВложенныйЗапрос.ВсегоСтрок > 1
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Номенклатура.НаименованиеПолное, """"),
	               |	ЗаявкаРаботы.Сотрудник,
	               |	ЗаявкаРаботы.ДатаНачала,
	               |	ЗаявкаРаботы.Продолжительность,
	               |	ЕстьNull(iga_РаботыСФиксированнымВременемЗаписи.Время, ЗаявкаРаботы.Ссылка.ВремяНачала)
	               |ИЗ
	               |	ВТ_ВсеРаботы КАК ЗаявкаРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |		ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |				ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗаявкаРаботы.Сотрудник)
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |	И НЕ ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗаявки);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаРаботы = ПакетРезультатов.Получить(3).Выбрать();
	
    
    // Перебираем услуги
	Нумератор = 0;
    Пока ВыборкаРаботы.Следующий() Цикл
		
		Нумератор = Нумератор + 1;
		
        ИмяВрача = Строка(ВыборкаРаботы.Врач);
        ДатаПриема = Формат(ВыборкаРаботы.ДатаНачала, "ДФ=dd.MM.yyyy");
        ВремяПриема = Формат(ВыборкаРаботы.ВремяНачала, "ДФ=ЧЧ:мм");
        
        // --- ДАННЫЕ НА РУССКОМ ---
        НазваниеУслугиRU = ВыборкаРаботы.НаименованиеПроцедуры;
        ТекстКалендарьRU = "Добавить в календарь";
		
		Если Не НазваниеУслугиRU = "" Тогда
			НазваниеУслугиRU = НазваниеУслугиRU + ",<br> ";
		КонецЕсли;
		
		КарточкаRU = "
		| <div class=""appointment-card"">
		|     <div class=""appointment-details"">
		|         <div class=""appointment-title"">" + Строка(Нумератор) + ") " + НазваниеУслугиRU + "⚕️ " + ИмяВрача + "</div>
		|         <div class=""appointment-info"">
		|             Дата: " + ДатаПриема + "<br>
		|             Время: " + ВремяПриема + "
		|         </div>
		|     </div>
		|     <div class=""calendar-action"" onclick=""addToCalendar('" + НазваниеУслугиRU + "', '" + ДатаПриема + "', '" + ВремяПриема + "', '" + ИмяВрача + "', '" + АдресКлиникиRU + "')"">
		|         <div class=""calendar-icon""></div>
		|         <div class=""calendar-text"">" + ТекстКалендарьRU + "</div>
		|     </div>
		| </div>";
		СписокУслугHTML_RU = СписокУслугHTML_RU + КарточкаRU;
		
		// --- ДАННЫЕ НА КАЗАХСКОМ ---
		НазваниеУслугиKK = ВыборкаРаботы.НаименованиеПроцедуры;
		ТекстКалендарьKK = "Күнтізбеге қосу";
		
		Если Не НазваниеУслугиKK = "" Тогда
			НазваниеУслугиKK = НазваниеУслугиKK + ",<br> ";
		КонецЕсли;

		КарточкаKK = "
		| <div class=""appointment-card"">
		|     <div class=""appointment-details"">
		|         <div class=""appointment-title"">" + Строка(Нумератор) + ") " + НазваниеУслугиKK + "⚕️ " + ИмяВрача + "</div>
		|         <div class=""appointment-info"">
		|             Күні: " + ДатаПриема + "<br>
		|             Уақыты: " + ВремяПриема + "
		|         </div>
		|     </div>
		|     <div class=""calendar-action"" onclick=""addToCalendar('" + НазваниеУслугиKK + "', '" + ДатаПриема + "', '" + ВремяПриема + "', '" + ИмяВрача + "', '" + АдресКлиникиKK + "')"">
		|         <div class=""calendar-icon""></div>
		|         <div class=""calendar-text"">" + ТекстКалендарьKK + "</div>
		|     </div>
		| </div>";
		СписокУслугHTML_KK = СписокУслугHTML_KK + КарточкаKK;
        
    КонецЦикла;
    
    // Получаем основной макет страницы
    Макет = ПолучитьОбщийМакет("омг_ИнтерфейсЗаписи");
    ТекстHTML = Макет.ПолучитьТекст();
    
    // Подставляем новые данные
    ТекстHTML = СтрЗаменить(ТекстHTML, "%НазваниеКлиники%", ИмяКлиники);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%АдресКлиникиRU%", АдресКлиникиRU);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%АдресКлиникиKK%", АдресКлиникиKK);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%СписокУслугHTML_RU%", СписокУслугHTML_RU);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%СписокУслугHTML_KK%", СписокУслугHTML_KK);
    
    // Заменяем ссылки на соцсети
    ТекстHTML = СтрЗаменить(ТекстHTML, "%СсылкаИнстаграм%", СсылкаИнстаграм);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%Ссылка2GIS%", Ссылка2GIS);
    
    Ответ = Новый HTTPСервисОтвет(200);
    Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
    Ответ.УстановитьТелоИзСтроки(ТекстHTML, КодировкаТекста.UTF8);
    
    Возврат Ответ;
    
КонецФункции

Функция СтраницаПодтвержденияЗаписиПолучить(Запрос)
    
    // Получаем ID записи из URL
    IDЗаписи = Запрос.ПараметрыЗапроса.Получить("id");
	
	Попытка
		СсылкаЗаявки = Документы.Заявка.ПолучитьСсылку(Новый УникальныйИдентификатор(IDЗаписи));
		
	Исключение
		Возврат Новый HTTPСервисОтвет(404);
	КонецПопытки;
	
	Запись = РегистрыСведений.iga_ЗаписиКОповещению.СоздатьМенеджерЗаписи();
	Запись.Заявка = СсылкаЗаявки;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		
		
		// --- ОТДАЕМ СТРАНИЦУ ОШИБКИ ---
		МакетОшибка = ПолучитьОбщийМакет("iga_ШаблонЗаписьНеНайдена");
		ТекстHTML_Ошибка = МакетОшибка.ПолучитьТекст();
		
		СсылкаWhatsApp = "https://wa.me/77710882357"; // Ссылка на WhatsApp клиники
		
		ТекстHTML_Ошибка = СтрЗаменить(ТекстHTML_Ошибка, "%СсылкаWhatsApp%", СсылкаWhatsApp);
		
		// Возвращаем статус 404 (Not Found) - это хорошая практика для веб-сервисов,
		// хотя визуально пациент увидит красивую страницу
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстHTML_Ошибка, КодировкаТекста.UTF8);
		Возврат Ответ;
		
	КонецЕсли;
		

	
	ОбработчикЭтапов = Обработки.iga_ОбработчикЭтапов.Создать();
	ОбработчикЭтапов.ВходящиеПараметры = Новый Структура;
	ОбработчикЭтапов.ВходящиеПараметры.Вставить("Заявка", СсылкаЗаявки);
	
    // Подготовка общих данных
    ИмяКлиники = "Divera";
    АдресКлиникиRU = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.АдресФилиалаНаРусском);
    АдресКлиникиKK = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.АдресФилиалаНаКазахском);
    
    // Новые ссылки для кнопок
    СсылкаИнстаграм = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.СсылкаИнстаграм);
    Ссылка2GIS = ОбработчикЭтапов.Алгоритм(Справочники.iga_Алгоритмы.Ссылка2гис);
    
    СписокУслугHTML_RU = "";
    СписокУслугHTML_KK = "";
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ГруппаЛис
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПозицииИсключенияИзОповещений.Номенклатура
	               |ИЗ
	               |	РегистрСведений.iga_ПозицииИсключенияИзОповещений КАК iga_ПозицииИсключенияИзОповещений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Статус КАК Статус
	               |ПОМЕСТИТЬ ВТ_СтатусыПодтверждения
	               |ИЗ
	               |	РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |ГДЕ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка = &Ссылка
	               |	И iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	               |	ЗаявкаРаботы.ДатаНачала КАК ДатаНачала,
	               |	ЕСТЬNULL(ЗаявкаРаботы.Сотрудник.Ссылка, ЗаявкаРаботы.Ссылка.Сотрудник) КАК Сотрудник,
	               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей КАК омг_БезЗаписиНесколькоВрачей,
	               |	ЗаявкаРаботы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ВсеРаботы
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И НЕ ЗаявкаРаботы.Номенклатура В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ГруппаЛис.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ГруппаЛис КАК ВТ_ГруппаЛис)
	               |	И ЗаявкаРаботы.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Заявка.Сотрудник КАК Сотрудник,
	               |	Заявка.Сотрудник.Наименование КАК СотрудникНаименование,
	               |	Заявка.ДатаНачала КАК ДатаНачала,
	               |	Заявка.ВремяНачала КАК ВремяНачала,
	               |	Заявка.НесколькоСотрудников КАК НесколькоСотрудников
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	               |	"""" КАК НаименованиеПроцедуры,
	               |	ЗаявкаРаботы.Сотрудник КАК Врач,
	               |	ЗаявкаРаботы.ДатаНачала КАК ДатаНачала,
	               |	ЕСТЬNULL(iga_РаботыСФиксированнымВременемЗаписи.Время, ЗаявкаРаботы.Ссылка.ВремяНачала) КАК ВремяНачала,
	               |	ВТ_СтатусыПодтверждения.Статус КАК Статус
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсеРаботы.Ссылка КАК Ссылка,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеРаботы.НомерСтроки) КАК ВсегоСтрок
	               |	ИЗ
	               |		ВТ_ВсеРаботы КАК ВТ_ВсеРаботы
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсеРаботы.Ссылка) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеРаботы КАК ЗаявкаРаботы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыПодтверждения КАК ВТ_СтатусыПодтверждения
	               |			ПО ЗаявкаРаботы.Номенклатура = ВТ_СтатусыПодтверждения.Работа
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |			ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |						И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |					ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗаявкаРаботы.Сотрудник)
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |	И ВложенныйЗапрос.ВсегоСтрок = 1
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура,
	               |	ЗаявкаРаботы.Номенклатура.НаименованиеПолное,
	               |	ЗаявкаРаботы.Сотрудник,
	               |	ЗаявкаРаботы.ДатаНачала,
	               |	ЕСТЬNULL(iga_РаботыСФиксированнымВременемЗаписи.Время, ЗаявкаРаботы.Ссылка.ВремяНачала),
	               |	ВТ_СтатусыПодтверждения.Статус
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсеРаботы.Ссылка КАК Ссылка,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеРаботы.НомерСтроки) КАК ВсегоСтрок
	               |	ИЗ
	               |		ВТ_ВсеРаботы КАК ВТ_ВсеРаботы
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсеРаботы.Ссылка) КАК ВложенныйЗапрос
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеРаботы КАК ЗаявкаРаботы
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыПодтверждения КАК ВТ_СтатусыПодтверждения
	               |			ПО ЗаявкаРаботы.Номенклатура = ВТ_СтатусыПодтверждения.Работа
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |			ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |						И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |					ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗаявкаРаботы.Сотрудник)
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |	И НЕ ЗаявкаРаботы.Номенклатура = &ПустаяНоменклатура
	               |	И ВложенныйЗапрос.ВсегоСтрок > 1
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура,
	               |	ЗаявкаРаботы.Номенклатура.НаименованиеПолное,
	               |	ЗаявкаРаботы.Сотрудник,
	               |	ЗаявкаРаботы.ДатаНачала,
	               |	ЕСТЬNULL(iga_РаботыСФиксированнымВременемЗаписи.Время, ЗаявкаРаботы.Ссылка.ВремяНачала),
	               |	ВТ_СтатусыПодтверждения.Статус
	               |ИЗ
	               |	ВТ_ВсеРаботы КАК ЗаявкаРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусыПодтверждения КАК ВТ_СтатусыПодтверждения
	               |		ПО ЗаявкаРаботы.Номенклатура = ВТ_СтатусыПодтверждения.Работа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |		ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.НОменклатура.ПустаяСсылка)
	               |				ИЛИ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗаявкаРаботы.Сотрудник)
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |	И НЕ ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗаявки);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаРаботы = ПакетРезультатов.Получить(4).Выбрать();
	
	Если ВыборкаРаботы.Количество() = 0 Тогда
		
		
		// --- ОТДАЕМ СТРАНИЦУ ОШИБКИ ---
		МакетОшибка = ПолучитьОбщийМакет("iga_ШаблонЗаписьНеНайдена");
		ТекстHTML_Ошибка = МакетОшибка.ПолучитьТекст();
		
		СсылкаWhatsApp = "https://wa.me/77710882357"; // Ссылка на WhatsApp клиники
		
		ТекстHTML_Ошибка = СтрЗаменить(ТекстHTML_Ошибка, "%СсылкаWhatsApp%", СсылкаWhatsApp);
		
		// Возвращаем статус 404 (Not Found) - это хорошая практика для веб-сервисов,
		// хотя визуально пациент увидит красивую страницу
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ТекстHTML_Ошибка, КодировкаТекста.UTF8);
		Возврат Ответ;
		
	КонецЕсли;
	
    
    // Перебираем услуги
	НомерСтр = 0;
    Пока ВыборкаРаботы.Следующий() Цикл
		
		ИдентификаторУслуги = Строка(ВыборкаРаботы.Номенклатура.УникальныйИдентификатор());
		
		НомерСтр = НомерСтр + 1;
		
        ИмяВрача = Строка(ВыборкаРаботы.Врач);
        ДатаПриема = Формат(ВыборкаРаботы.ДатаНачала, "ДФ=dd.MM.yyyy");
        ВремяПриема = Формат(ВыборкаРаботы.ВремяНачала, "ДФ=ЧЧ:мм");
        
        // --- 1. ПРОВЕРКА СТАТУСА ИЗ БАЗЫ 1С ---
	    // В реальности здесь будет что-то вроде: ТекущийСтатус = СтрокаУслуги.Статус;
	    ТекущийСтатус = ВыборкаРаботы.Статус; // Варианты: "Ожидает", "Подтвержден", "Отменен"
	    
	    // --- 2. ГЕНЕРАЦИЯ БЛОКА ДЕЙСТВИЙ РУС ---
	    НазваниеУслугиRU = ВыборкаРаботы.НаименованиеПроцедуры;
		
		Если ЗначениеЗаполнено(НазваниеУслугиRU) Тогда
			НазваниеУслугиRU = НазваниеУслугиRU + ",<br> ";
		КонецЕсли;
		
	    ВсплывашкаПодтвердитьRU = "Вы уверены, что хотите подтвердить запись на " + НазваниеУслугиRU + "?";
	    ВсплывашкаОтменитьRU    = "Вы действительно хотите отменить запись на " + НазваниеУслугиRU + "?";
		ВсплывашкаПеренестиRU   = "Запросить перенос времени для " + НазваниеУслугиRU + "? С вами свяжется менеджер.";		
		
	    БлокДействийRU = "";
	    Если ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено Тогда
	        БлокДействийRU = "<div class=""status-msg success"">✅ Подтверждено</div>";
	    ИначеЕсли ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено Тогда
	        БлокДействийRU = "<div class=""status-msg cancel"">❌ Запрошена отмена</div>";
		ИначеЕсли ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияЗаявок.ТребуетсяПеренос Тогда
			БлокДействийRU = "<div class=""status-msg reschedule"">⏎ Запрошен перенос</div>";
		Иначе // Статус "Ожидает" - рисуем кнопки и скрытые блоки статусов
			БлокДействийRU = "
			| <div class=""action-buttons"" id=""actions-ru-" + ИдентификаторУслуги + """>
	        |     <button class=""btn-action btn-confirm"" onclick=""sendDecision(this, 'confirm', '" + IDЗаписи + "', '" + ИдентификаторУслуги + "', '" + ВсплывашкаПодтвердитьRU + "')"">Подтвердить</button>
      		|     <button class=""btn-action btn-reschedule"" onclick=""sendDecision(this, 'reschedule', '" + IDЗаписи + "', '" + ИдентификаторУслуги + "', '" + ВсплывашкаПеренестиRU + "')"">Перенести</button>
	        |     <button class=""btn-action btn-cancel"" onclick=""sendDecision(this, 'cancel', '" + IDЗаписи + "', '" + ИдентификаторУслуги + "', '" + ВсплывашкаОтменитьRU + "')"">Запросить отмену</button>
	        | </div>
	        | <div class=""status-msg success"" id=""status-success-ru-" + ИдентификаторУслуги + """ style=""display:none;"">✅ Подтверждено</div>
	        | <div class=""status-msg cancel"" id=""status-cancel-ru-" + ИдентификаторУслуги + """ style=""display:none;"">❌ Запрошена отмена</div>
      		| <div class=""status-msg reschedule"" id=""status-reschedule-ru-" + ИдентификаторУслуги + """ style=""display:none;"">⏎ Запрошен перенос</div>";
	    КонецЕсли;

	    КарточкаRU = "
	    | <div class=""appointment-card"">
	    |     <div class=""appointment-details"">
	    |         <div class=""appointment-title"">" + НомерСтр + ") " + НазваниеУслугиRU + "⚕️ " + ИмяВрача + "</div>
	    |         <div class=""appointment-info"">Дата: " + ДатаПриема + "<br>Время: " + ВремяПриема + "</div>
	    |     </div>
	    |     " + БлокДействийRU + "
	    | </div>";
	    СписокУслугHTML_RU = СписокУслугHTML_RU + КарточкаRU;

	    // --- 3. ГЕНЕРАЦИЯ БЛОКА ДЕЙСТВИЙ КАЗ ---
	    НазваниеУслугиKK = ВыборкаРаботы.НаименованиеПроцедуры;

		Если ЗначениеЗаполнено(НазваниеУслугиKK) Тогда
			НазваниеУслугиKK = НазваниеУслугиKK + ",<br> ";
		КонецЕсли;
		
		ВсплывашкаПодтвердитьKK = "Сіз " + НазваниеУслугиKK + " жазбасын растайтыныңызға сенімдісіз бе?";
	    ВсплывашкаОтменитьKK    = "Сіз " + НазваниеУслугиKK + " жазбасынан бас тартатыныңызға сенімдісіз бе?";
		ВсплывашкаПеренестиKK   = "" + НазваниеУслугиKK + " үшін уақытты ауыстыруды сұрайсыз ба? Менеджер сізге хабарласады.";
	    
	    БлокДействийKK = "";
	    Если ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено Тогда
	        БлокДействийKK = "<div class=""status-msg success"">✅ Расталды</div>";
	    ИначеЕсли ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено Тогда
	        БлокДействийKK = "<div class=""status-msg cancel"">❌ Күшін жою сұралды</div>";
		ИначеЕсли ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияЗаявок.ТребуетсяПеренос Тогда
			БлокДействийKK = "<div class=""status-msg reschedule"">⏎ Ауыстыру сұралды</div>";
	    Иначе
	        БлокДействийKK = "
	        | <div class=""action-buttons"" id=""actions-kk-" + ИдентификаторУслуги + """>
	        |     <button class=""btn-action btn-confirm"" onclick=""sendDecision(this, 'confirm', '" + IDЗаписи + "', '" + ИдентификаторУслуги + "', '" + ВсплывашкаПодтвердитьKK + "')"">Растау</button>
      		|     <button class=""btn-action btn-reschedule"" onclick=""sendDecision(this, 'reschedule', '" + IDЗаписи + "', '" + ИдентификаторУслуги + "', '" + ВсплывашкаПеренестиKK + "')"">Ауыстыру</button>
	        |     <button class=""btn-action btn-cancel"" onclick=""sendDecision(this, 'cancel', '" + IDЗаписи + "', '" + ИдентификаторУслуги + "', '" + ВсплывашкаОтменитьKK + "')"">Күшін жоюды сұрау</button>
	        | </div>
	        | <div class=""status-msg success"" id=""status-success-kk-" + ИдентификаторУслуги + """ style=""display:none;"">✅ Расталды</div>
	        | <div class=""status-msg cancel"" id=""status-cancel-kk-" + ИдентификаторУслуги + """ style=""display:none;"">❌ Күшін жою сұралды</div>
      		| <div class=""status-msg reschedule"" id=""status-reschedule-kk-" + ИдентификаторУслуги + """ style=""display:none;"">⏎ Ауыстыру сұралды</div>";
  	    КонецЕсли;

	    КарточкаKK = "
	    | <div class=""appointment-card"">
	    |     <div class=""appointment-details"">
	    |         <div class=""appointment-title"">" + НомерСтр + ") " + НазваниеУслугиKK + "⚕️ " + ИмяВрача + "</div>
	    |         <div class=""appointment-info"">Күні: " + ДатаПриема + "<br>Уақыты: " + ВремяПриема + "</div>
	    |     </div>
	    |     " + БлокДействийKK + "
	    | </div>";
	    СписокУслугHTML_KK = СписокУслугHTML_KK + КарточкаKK;
	        
    КонецЦикла;
    
    // Получаем основной макет страницы
    Макет = ПолучитьОбщийМакет("iga_ШаблонПодвержденияЗаписи");
    ТекстHTML = Макет.ПолучитьТекст();
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "/ИмяВашейБазы/hs/api/appointments", Константы.iga_АдресСайтаПодтвержденияЗаявки.Получить() + "/hs/int-services/med/confirm");
    
    // Подставляем новые данные
    ТекстHTML = СтрЗаменить(ТекстHTML, "%НазваниеКлиники%", ИмяКлиники);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%АдресКлиникиRU%", АдресКлиникиRU);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%АдресКлиникиKK%", АдресКлиникиKK);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%СписокУслугHTML_RU%", СписокУслугHTML_RU);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%СписокУслугHTML_KK%", СписокУслугHTML_KK);
    
    // Заменяем ссылки на соцсети
    ТекстHTML = СтрЗаменить(ТекстHTML, "%СсылкаИнстаграм%", СсылкаИнстаграм);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%Ссылка2GIS%", Ссылка2GIS);
	
    Ответ = Новый HTTPСервисОтвет(200);
    Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");
    Ответ.УстановитьТелоИзСтроки(ТекстHTML, КодировкаТекста.UTF8);
    
    Возврат Ответ;
    
КонецФункции

Функция ИзменениеСтатусаПодтвержденияЗаявкиPOST(Запрос)
    
    // 1. Получаем тело запроса от браузера
    ТелоЗапросаСтрока = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
    
    Если ПустаяСтрока(ТелоЗапросаСтрока) Тогда
        Возврат Новый HTTPСервисОтвет(400); // Bad Request (Пустой запрос)
    КонецЕсли;
    
    Попытка
        // 2. Читаем JSON в структуру
        ЧтениеJSON = Новый ЧтениеJSON;
        ЧтениеJSON.УстановитьСтроку(ТелоЗапросаСтрока);
        Данные = ПрочитатьJSON(ЧтениеJSON);
        ЧтениеJSON.Закрыть();
        
        // Получаем наши данные (как мы назвали их в JS)
        МетодДействия = Данные.metod; // "confirm" или "cancel" или "reschedule"
        IDЗаписи = Данные.id;
        НомерСтроки = Данные.num; // Это будет Число
        
        // 3. --- ЗДЕСЬ ВАША ЛОГИКА ---
        // Ищем документ по IDЗаписи
        // Меняем статус нужной строки (НомерСтроки) на "Подтвержден" или "Отменен"
        // Записываем документ
		
		СсылкаЗаявки = Документы.Заявка.ПолучитьСсылку(Новый УникальныйИдентификатор(IDЗаписи));
		СсылкаУслуги = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(НомерСтроки));
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа,
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи КАК ДатаЗаписи,
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.Статус КАК Статус,
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.Обработано КАК Обработано
		               |ИЗ
		               |	РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
		               |ГДЕ
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка = &Заявка
		               |	И iga_СтатусыПодтвержденияСтрокЗаявок.Работа = &Работа";
		Запрос.УстановитьПараметр("Заявка", СсылкаЗаявки);
		Запрос.УстановитьПараметр("Работа", СсылкаУслуги);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
		Запись.Заявка = СсылкаЗаявки;
		Запись.Работа = СсылкаУслуги;
		Если Выборка.Следующий() Тогда
			Запись.ДатаЗаписи = Выборка.ДатаЗаписи;
		КонецЕсли;
		
		СтатусПодтверждено = Ложь;
		СтатусОтменено = Ложь;
		
		Если МетодДействия = "confirm" Тогда		
			СтатусСтроки = Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено;
			СтатусПодтверждено = Истина;
		ИначеЕсли МетодДействия = "reschedule" Тогда
			СтатусСтроки = Перечисления.iga_СтатусыПодтвержденияЗаявок.ТребуетсяПеренос;
		Иначе
			СтатусСтроки = Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено;
			СтатусОтменено = Истина;
		КонецЕсли;
		Запись.Статус = СтатусСтроки;
		Запись.Записать();  
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаРаботы.Ссылка КАК Ссылка,
		               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
		               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура
		               |ПОМЕСТИТЬ ВТ_ПозицииЗаявки
		               |ИЗ
		               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
		               |ГДЕ
		               |	ЗаявкаРаботы.Ссылка = &Заявка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка
		               |ИЗ
		               |	ВТ_ПозицииЗаявки КАК ВТ_ПозицииЗаявки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ВТ_ПозицииЗаявки.Ссылка КАК Ссылка,
		               |			МАКСИМУМ(ВТ_ПозицииЗаявки.НомерСтроки) КАК КоличествоСтрок
		               |		ИЗ
		               |			ВТ_ПозицииЗаявки КАК ВТ_ПозицииЗаявки
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ВТ_ПозицииЗаявки.Ссылка) КАК ВложенныйЗапрос
		               |		ПО ВТ_ПозицииЗаявки.Ссылка = ВложенныйЗапрос.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
		               |		ПО ВТ_ПозицииЗаявки.Ссылка = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка
		               |			И ВТ_ПозицииЗаявки.Номенклатура = iga_СтатусыПодтвержденияСтрокЗаявок.Работа
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА ВложенныйЗапрос.КоличествоСтрок = 1
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ НЕ ВТ_ПозицииЗаявки.Номенклатура = &ПустаяНоменклатура
		               |		КОНЕЦ
		               |	И НЕ ЕСТЬNULL(iga_СтатусыПодтвержденияСтрокЗаявок.Статус, НЕОПРЕДЕЛЕНО) = &СтатусОтменено";
		Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
		Запрос.УстановитьПараметр("СтатусОтменено", СтатусСтроки);
		ИзменениеСостояния = Запрос.Выполнить().Пустой();
		
		Если ИзменениеСостояния И (СтатусПодтверждено Или СтатусОтменено) Тогда
			Если СтатусПодтверждено Тогда   
				ЗаявкаОбъект = СсылкаЗаявки.ПолучитьОбъект();
				Состояние = Справочники.ВидыСостоянийЗаявок.НайтиПоНаименованию("Подтверждена");
				Если Состояние.Пустая() Тогда
					Состояние = Справочники.ВидыСостоянийЗаявок.СоздатьЭлемент();
					Состояние.Наименование = "Подтверждена";
					Состояние.Записать();
					Состояние = Состояние.Ссылка;
				КонецЕсли;
				
				ЗаявкаОбъект.Состояние = Состояние;
				
				Если ЗаявкаОбъект.Проведен Тогда
					ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Иначе
					ЗаявкаОбъект.Записать();
				КонецЕсли;
			
			Иначе
				ЗаписьПричины = РегистрыСведений.ПричиныОтменыЗаявок.СоздатьМенеджерЗаписи();
				ЗаписьПричины.Заявка = СсылкаЗаявки;
				ЗаписьПричины.ПричинаОтменыЗаявки = "Отменена пациентом при подтверждении онлайн";
				ЗаписьПричины.Период = ТекущаяДата();
				ЗаписьПричины.Записать(); 
			КонецЕсли;
			
		КонецЕсли;
		
        // Для примера выведем в журнал регистрации
        ЗаписьЖурналаРегистрации("HTTP_ЗаписьНаПрием", УровеньЖурналаРегистрации.Информация,,, 
            "Действие: " + МетодДействия + ", ID: " + IDЗаписи + ", Строка: " + Строка(НомерСтроки));
            
    Исключение
        ЗаписьЖурналаРегистрации("HTTP_ЗаписьНаПрием", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
        Возврат Новый HTTPСервисОтвет(500); // Ошибка на сервере
    КонецПопытки;

    // 4. Отвечаем браузеру, что все прошло отлично
    Ответ = Новый HTTPСервисОтвет(200);
    Возврат Ответ;
    
КонецФункции

&Вместо("ИнтерфейсПациентаПолучить")
Функция iga_ИнтерфейсПациентаПолучить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Метод = Запрос.ПараметрыURL.Получить("metod");
	
	Если Метод = "image" Тогда
		
		Ответ = ПолучитьИзображениеДляОтправки(Запрос);
		
	ИначеЕсли Метод = "appointments"  Тогда
		Ответ = СтраницаОповещенияОЗаписиПолучить(Запрос);
	ИначеЕсли Метод = "confirm" Тогда
		Ответ = СтраницаПодтвержденияЗаписиПолучить(Запрос);
	Иначе
		Ответ = ПродолжитьВызов(Запрос);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;

КонецФункции

&Вместо("ИнтерфейсПациентаОтправить")
Функция iga_ИнтерфейсПациентаОтправить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Метод = Запрос.ПараметрыURL.Получить("metod");
	
	Если Метод = "confirm" Тогда
		
		Ответ = ИзменениеСтатусаПодтвержденияЗаявкиPOST(Запрос);
		
	Иначе
		Ответ = ПродолжитьВызов(Запрос);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции
